'''
a = [1, 2, 3, 4, 5]
if 0 in a:
    print('Есть ноль')
'''

'''
a = []
b = len(a)
if b < 1:
    print('Пустой список')
'''

'''
a = ['1', '2', '3', '4', '5', '6', '7', '8', '9']
b = len(a)
if b > 5:
    print('Большой список')
'''

'''
a = [6, 2, 3, 4, 5]
if a[0] > a[-1]:
    print('Первый больше')
'''

'''

'''
a = [5, 3, 4]
a2 = list(dict.fromkeys(a))
if len(a) == len(a2):
    print('Без повторов')
'''
a = [100, 2, 3, 4, 5]
if sum(a) > 100:
    print('Сумма большая')
'''

'''
a = ['python', '2', '3', '4', '5', '6', '7', '8', '9']
if a.count('python') >= 1:
    print('Python найден')
'''

'''
a = [1, 2, 3, 4, 51]
if max(a) > 50:
    print('Большое число')
'''

'''
a = [1, 2, 3, 4, 5]
if len(a) / 2:
    print('Четное кол-во')
'''

'''
a = ['1', '2', '3', '67154654511', '5', '6', '7', '8', '9']
if len(max(a, key=len)) > 10:
    print('Есть длинная строка')
'''
